app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = 'George Lucas'
---
 def director
    id = params[:id] # retrieve movie ID from URI route
    @movie = Movie.find(id) # look up movie by unique ID
    # will render app/views/movies/show.<extension> by default
    if @movie.director.nil? or @movie.director.empty?